In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

In [2]:
sneakers_df = pd.read_csv('2019 Winter Data Science Intern Challenge Data Set - Sheet1.csv')

In [3]:
sneakers_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   order_id        5000 non-null   int64
 1   shop_id         5000 non-null   int64
 2   user_id         5000 non-null   int64
 3   order_amount    5000 non-null   int64
 4   total_items     5000 non-null   int64
 5   payment_method  5000 non-null   object
 6   created_at      5000 non-null   object
dtypes: int64(5), object(2)
memory usage: 273.6+ KB

In [4]:
sneakers_df.head()

,order_id,shop_id,user_id,order_amount,total_items,payment_method,created_at
0,1,53,746,224,2,cash,2017-03-13 12:36:56
1,2,92,925,90,1,cash,2017-03-03 17:38:52
2,3,44,861,144,1,cash,2017-03-14 4:23:56
3,4,18,935,156,1,credit_card,2017-03-26 12:43:37
4,5,18,883,156,1,credit_card,2017-03-01 4:35:11

With the calculated AOV of 3145.13, it is likely that the calculted value is for the average order amount, which is shown below

In [5]:
#This line shows the Average Order Amount
sum (sneakers_df['order_amount']) / len (sneakers_df['order_amount'])

3145.128

In [6]:
average_order_value = sum(sneakers_df['order_amount']) / sum (sneakers_df['total_items'])

In [7]:
print ('Average Order Value = ${:0,.0f}'.format(average_order_value))

Average Order Value = $358

Other Metrics From the Data

In [8]:
min_amount = min (sneakers_df['order_amount'])
max_amount = max (sneakers_df['order_amount'])
total_revenue = sum (sneakers_df['order_amount'])

In [9]:
print ('Max order amount = ${:0,.0f}' .format(max_amount))
print ('Min order amount = ${:0,.0f}'.format (min_amount))
print ('Total revenue = ${:0,.0f}'.format(total_revenue))

Max order amount = $704,000
Min order amount = $90
Total revenue = $15,725,640

In [10]:
sneakers_df [sneakers_df['order_amount'] == 704000]

,order_id,shop_id,user_id,order_amount,total_items,payment_method,created_at
15,16,42,607,704000,2000,credit_card,2017-03-07 4:00:00
60,61,42,607,704000,2000,credit_card,2017-03-04 4:00:00
520,521,42,607,704000,2000,credit_card,2017-03-02 4:00:00
1104,1105,42,607,704000,2000,credit_card,2017-03-24 4:00:00
1362,1363,42,607,704000,2000,credit_card,2017-03-15 4:00:00
1436,1437,42,607,704000,2000,credit_card,2017-03-11 4:00:00
1562,1563,42,607,704000,2000,credit_card,2017-03-19 4:00:00
1602,1603,42,607,704000,2000,credit_card,2017-03-17 4:00:00
2153,2154,42,607,704000,2000,credit_card,2017-03-12 4:00:00
2297,2298,42,607,704000,2000,credit_card,2017-03-07 4:00:00
2835,2836,42,607,704000,2000,credit_card,2017-03-28 4:00:00
2969,2970,42,607,704000,2000,credit_card,2017-03-28 4:00:00
3332,3333,42,607,704000,2000,credit_card,2017-03-24 4:00:00
4056,4057,42,607,704000,2000,credit_card,2017-03-28 4:00:00
4646,4647,42,607,704000,2000,credit_card,2017-03-02 4:00:00
4868,4869,42,607,704000,2000,credit_card,2017-03-22 4:00:00
4882,4883,42,607,704000,2000,credit_card,2017-03-25 4:00:00

The data shows the maximum single order occured 17 times from same shop, same user and same time on different days

shop_id with the highest number of sales

In [11]:
#Shows shop_id 53 has the highest number of sales
(sneakers_df['shop_id'].value_counts(ascending= False, ))

53    68
71    66
19    64
13    63
89    61
      ..
74    38
56    37
67    37
38    35
85    35
Name: shop_id, Length: 100, dtype: int64